CREATE TABLE IF NOT EXISTS teachers (
    user_id SERIAL PRIMARY KEY,
    teacherName VARCHAR(255),
    phone VARCHAR(50),
    profession VARCHAR(50)
);

INSERT INTO teachers (teacherName, phone, profession) VALUES
('אדי יוסוב', '054-5896321', 'פיסיקה'),
('אודין קלס', '054-3214567', 'פיסיקה'),
('אורי איגר', '054-9876543', 'פיסיקה'),
('אורן פרבר', '054-1239874', 'פיסיקה'),
('איל כהן', '054-7894561', 'פיסיקה'),
('אלון מוסקונה', '054-6547893', 'פיסיקה'),
('אלונה ורד', '054-1597538', 'פיסיקה'),
('אריאלה זגל', '054-8529631', 'פיסיקה'),
('אריק גלבוע', '054-7418529', 'פיסיקה'),
('אריק רוזנברג', '054-3692587', 'פיסיקה'),
('גלעד סבירסקי', '054-8975641', 'פיסיקה'),
('חיים שמואלי', '054-1472583', 'פיסיקה'),
('טל וייס', '054-7539518', 'פיסיקה'),
('יבגני ברודצקי', '054-9638521', 'פיסיקה'),
('ילנה סימון', '054-1234567', 'פיסיקה'),
('יפתח אילסר', '054-9876543', 'פיסיקה'),
('ליאור יוסוב', '054-4567891', 'פיסיקה'),
('מיכאל לוי', '054-1235789', 'פיסיקה'),
('מתיאס בירמן', '054-8796541', 'פיסיקה'),
('נועם איל', '054-3571598', 'פיסיקה'),
('נועם דוד', '054-7412589', 'פיסיקה'),
('נועם ליאור', '054-8523697', 'פיסיקה'),
('סלימאן אבו טאלב', '054-1596328', 'פיסיקה'),
('עדי זומר', '054-7531598', 'פיסיקה'),
('עידית גרומן', '054-9517532', 'פיסיקה'),
('עמית חן', '054-8521479', 'פיסיקה'),
('עמר ליכטנשטיין', '054-6547893', 'פיסיקה'),
('ראובן שפיטלניק', '054-9871236', 'פיסיקה'),
('שי נוטר', '054-7894563', 'פיסיקה'),
('שלמה רוזנפלד', '054-2583691', 'פיסיקה'),
('אביב חגולי', '054-8521473', 'כימיה'),
('אושרית פוליקר', '054-7418523', 'כימיה'),
('אירנה אסייג', '054-9638527', 'כימיה'),
('איתן קריין', '054-1592584', 'כימיה'),
('אסנת רווה', '054-7538965', 'כימיה'),
('בן אושר', '054-8523697', 'כימיה'),
('דינה דנה', '054-1597532', 'כימיה'),
('זאב זיניוק', '054-3698521', 'כימיה'),
('יוליה ויינר', '054-7415829', 'כימיה'),
('יעל הרץ', '054-9638521', 'כימיה'),
('מריה זצפין', '054-1236547', 'כימיה'),
('נטלי הולצמן', '054-8974561', 'כימיה'),
('רון שוורץ', '054-1597532', 'כימיה'),
('רעיה קוברסקי', '054-9638521', 'כימיה');

CREATE TABLE IF NOT EXISTS rooms (
    roomNumber VARCHAR(50) PRIMARY KEY,
    profession VARCHAR(50) DEFAULT 'כללי'
);

INSERT INTO rooms (roomNumber) VALUES
('102'),('103'),('104'),('105'),('106'),('107'),
('202'),('203'),('204'),('205'),('206'),('207'),
('302'),('303'),('304'),('305'),('306'),('307'),
('402'),('403'),('404'),('405'),('406'),('407'),
('חדר ישיבות'),('ספריה'),('אודיטוריום');


CREATE TABLE IF NOT EXISTS schools (
    schoolName VARCHAR(255) PRIMARY KEY,
    schoolPhone VARCHAR(50),
    schoolLocation VARCHAR(255)
);

INSERT INTO schools (schoolName, schoolPhone, schoolLocation) VALUES
('אג''יאל', '054-3545456', 'לא ידוע'),
('אולפנית', '054-3545456', 'לא ידוע'),
('אליאנס', '054-3545457', 'לא ידוע'),
('בר אילן', '054-3545458', 'לא ידוע'),
('גורדון', '054-3545466', 'לא ידוע'),
('גע"ה', '054-3545456', 'לא ידוע'),
('ד.פ.', '054-3545446', 'לא ידוע'),
('יאפא אלמ''', '054-3545436', 'לא ידוע'),
('יצחק שמיר', '054-3545426', 'לא ידוע'),
('ליידי דיוויס', '054-3545451', 'לא ידוע'),
('סטודיו אנקורי', '054-3545126', 'לא ידוע'),
('סינג', '054-3545136', 'לא ידוע'),
('ע. א', '054-3545156', 'לא ידוע'),
('ע. ב''ג', '054-3545156', 'לא ידוע'),
('ע. ה', '054-3545156', 'לא ידוע'),
('ע. ו', '054-3545156', 'לא ידוע'),
('ע. ז', '054-3545156', 'לא ידוע'),
('ע. ט', '054-3545156', 'לא ידוע'),
('ע. י''ד', '054-3545156', 'לא ידוע'),
('ע. י''ב', '054-3545156', 'לא ידוע'),
('עמוס עוז', '054-3545156', 'לא ידוע'),
('פלך', '054-3545156', 'לא ידוע'),
('צמרות', '054-3545156', 'לא ידוע'),
('ראשית בנות', '054-3545156', 'לא ידוע'),
('רוגוזין', '054-3545156', 'לא ידוע'),
('תיכון חדש', '054-3545156', 'לא ידוע'),
('תיכונט', '054-3545156', 'לא ידוע');






