SELECT current_database();

CREATE TABLE IF NOT EXISTS teachers (
    user_id SERIAL PRIMARY KEY,
    teacherName VARCHAR(255),
    phone VARCHAR(50),
    profession VARCHAR(50)
);

INSERT INTO teachers (teacherName, phone, profession) VALUES
('אדי יוסוב', '054-5896321', 'פיסיקה'),
('אודין קלס', '054-3214567', 'פיסיקה'),
('אורי איגר', '054-9876543', 'פיסיקה'),
('אורן פרבר', '054-1239874', 'פיסיקה'),
('איל כהן', '054-7894561', 'פיסיקה'),
('אלון מוסקונה', '054-6547893', 'פיסיקה'),
('אלונה ורד', '054-1597538', 'פיסיקה'),
('אריאלה זגל', '054-8529631', 'פיסיקה'),
('אריק גלבוע', '054-7418529', 'פיסיקה'),
('אריק רוזנברג', '054-3692587', 'פיסיקה'),
('גלעד סבירסקי', '054-8975641', 'פיסיקה'),
('חיים שמואלי', '054-1472583', 'פיסיקה'),
('טל וייס', '054-7539518', 'פיסיקה'),
('יבגני ברודצקי', '054-9638521', 'פיסיקה'),
('ילנה סימון', '054-1234567', 'פיסיקה'),
('יפתח אילסר', '054-9876543', 'פיסיקה'),
('ליאור יוסוב', '054-4567891', 'פיסיקה'),
('מיכאל לוי', '054-1235789', 'פיסיקה'),
('מתיאס בירמן', '054-8796541', 'פיסיקה'),
('נועם איל', '054-3571598', 'פיסיקה'),
('נועם דוד', '054-7412589', 'פיסיקה'),
('נועם ליאור', '054-8523697', 'פיסיקה'),
('סלימאן אבו טאלב', '054-1596328', 'פיסיקה'),
('עדי זומר', '054-7531598', 'פיסיקה'),
('עידית גרומן', '054-9517532', 'פיסיקה'),
('עמית חן', '054-8521479', 'פיסיקה'),
('עמר ליכטנשטיין', '054-6547893', 'פיסיקה'),
('ראובן שפיטלניק', '054-9871236', 'פיסיקה'),
('שי נוטר', '054-7894563', 'פיסיקה'),
('שלמה רוזנפלד', '054-2583691', 'פיסיקה'),
('אביב חגולי', '054-8521473', 'כימיה'),
('אושרית פוליקר', '054-7418523', 'כימיה'),
('אירנה אסייג', '054-9638527', 'כימיה'),
('איתן קריין', '054-1592584', 'כימיה'),
('אסנת רווה', '054-7538965', 'כימיה'),
('בן אושר', '054-8523697', 'כימיה'),
('דינה דנה', '054-1597532', 'כימיה'),
('זאב זיניוק', '054-3698521', 'כימיה'),
('יוליה ויינר', '054-7415829', 'כימיה'),
('יעל הרץ', '054-9638521', 'כימיה'),
('מריה זצפין', '054-1236547', 'כימיה'),
('נטלי הולצמן', '054-8974561', 'כימיה'),
('רון שוורץ', '054-1597532', 'כימיה'),
('רעיה קוברסקי', '054-9638521', 'כימיה');

CREATE TABLE IF NOT EXISTS rooms (
    roomNumber VARCHAR(50) PRIMARY KEY,
    profession VARCHAR(50) DEFAULT 'כללי'
);

INSERT INTO rooms (roomNumber) VALUES
('102'),('103'),('104'),('105'),('106'),('107'),
('202'),('203'),('204'),('205'),('206'),('207'),
('302'),('303'),('304'),('305'),('306'),('307'),
('402'),('403'),('404'),('405'),('406'),('407'),
('חדר ישיבות'),('ספריה'),('אודיטוריום');


CREATE TABLE IF NOT EXISTS schools (
    schoolName VARCHAR(255) PRIMARY KEY,
    schoolPhone VARCHAR(50),
    schoolLocation VARCHAR(255)
);


INSERT INTO schools (schoolName, schoolPhone, schoolLocation) VALUES
	('אג''יאל', '03-6888888', 'דרך ירושלים 66, יפו'),
    ('אולפנית', '03-5188888', 'רחוב הרצל 106, תל אביב-יפו'),
    ('אליאנס', '03-6966666', 'רחוב צייטלין 1, תל אביב-יפו'),
    ('בר אילן', '03-6055555', 'רחוב בן יהודה 94, תל אביב-יפו'),
    ('גורדון', '03-6955555', 'רחוב גורדון 59, תל אביב-יפו'),
    ('גע"ה', '03-5177777', 'רחוב שדרות ירושלים 136, תל אביב-יפו'),
    ('ד.פ.', '03-6044444', 'רחוב דפנה 5, תל אביב-יפו'),
    ('יאפא אלמ''', '03-6822222', 'דרך ירושלים 122, יפו'),
    ('יצחק שמיר', '03-6055555', 'רחוב אליפלט 4, תל אביב-יפו'),
    ('ליידי דיוויס', '03-5288888', 'רחוב שינקין 2, תל אביב-יפו'),
    ('סטודיו אנקורי', '03-6444444', 'רחוב שמעון התרסי 18, תל אביב-יפו'),
    ('סינג', '03-6988888', 'רחוב צייטלין 2, תל אביב-יפו'),
    ('ע. א', '03-5244444', 'רחוב חיים לבנון 12, תל אביב-יפו'),
    ('ע. ב''ג', '03-5222222', 'רחוב שדרות בן גוריון 14, תל אביב-יפו'),
    ('ע. ה', '03-6955555', 'רחוב האלה 3, תל אביב-יפו'),
    ('ע. ו', '03-5222222', 'רחוב וולפסון 18, תל אביב-יפו'),
    ('ע. ז', '03-6955555', 'רחוב זבוטינסקי 7, תל אביב-יפו'),
    ('ע. ט', '03-5222222', 'רחוב טשרניחובסקי 3, תל אביב-יפו'),
    ('ע. י''ד', '03-6955555', 'רחוב י''ד 10, תל אביב-יפו'),
    ('ע. י''ב', '03-5222222', 'רחוב י''ב 5, תל אביב-יפו'),
    ('עמוס עוז', '03-6888888', 'רחוב עזרא 12, תל אביב-יפו'),
    ('פלך', '03-6966666', 'רחוב פלך 15, תל אביב-יפו'),
    ('צמרות', '03-6955555', 'רחוב צמרות 20, תל אביב-יפו'),
    ('ראשית בנות', '03-6888888', 'רחוב ראשית 5, תל אביב-יפו'),
    ('רוגוזין', '03-6966666', 'רחוב רוגוזין 10, תל אביב-יפו'),
    ('תיכון חדש', '03-5255555', 'רחוב משה שרת 1, תל אביב-יפו'),
    ('תיכונט', '03-6444444', 'רחוב ש"י עגנון 20, תל אביב-יפו');

